neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32C0.c

#include <stdlib.h>
#include <stdbool.h>
#include <stdint.h>
#include <math.h>
#include <time.h>

#include "soc.h"

#include "DMA/DMA.h"

#include "NeonRTOS.h"

#ifdef STM32C0

#include "DMA_STM32_Index.h"

#include "DMA_STM32.h"

//#include "CAN/Device/STM32/CAN_STM32.h"
#include "I2C/Device/STM32/I2C_Master_STM32.h"
#include "SPI/Device/STM32/SPI_Master_STM32.h"
#include "UART/Device/STM32/UART_STM32.h"

#define DMA_CHANNEL_LOCK(channel_index) if (NeonRTOS_LockObjLock(&DMA_Channel_Mutex[(channel_index)], DMA_WAIT_ALLOCATED_TIMEOUT) != NeonRTOS_OK) { return hwDMA_MutexTimeout; }
#define DMA_CHANNEL_UNLOCK(channel_index) if (NeonRTOS_LockObjUnlock(&DMA_Channel_Mutex[(channel_index)]) != NeonRTOS_OK) { return hwDMA_MutexTimeout; }

static bool DMA_NVIC_Init_Status[hwDMA_Channel_Index_MAX] = {false};

static const hwDMA_Channel_Index UART_DMA_Channel_Map[hwUART_Index_MAX][hwDMA_Peripheral_Direction_MAX] =
{
#if defined(UART1_BASE) || defined(USART1_BASE)
    {hwDMA_Channel_Index_1, hwDMA_Channel_Index_2},
#endif
#if defined(UART2_BASE) || defined(USART2_BASE)
    {hwDMA_Channel_Index_3, hwDMA_Channel_Index_1},
#endif
#if defined(UART3_BASE) || defined(USART3_BASE)
    {hwDMA_Channel_Index_4, hwDMA_Channel_Index_5},
#endif
#if defined(UART4_BASE) || defined(USART4_BASE)
    {hwDMA_Channel_Index_6, hwDMA_Channel_Index_7},
#endif
};

static const hwDMA_Channel_Index SPI_DMA_Channel_Map[hwSPI_Index_MAX][hwDMA_Peripheral_Direction_MAX] =
{
#if defined(SPI1_BASE)
    {hwDMA_Channel_Index_1, hwDMA_Channel_Index_2},
#endif
#if defined(SPI2_BASE)
    {hwDMA_Channel_Index_4, hwDMA_Channel_Index_5},
#endif
};

static const hwDMA_Channel_Index I2C_DMA_Channel_Map[hwI2C_Index_MAX][hwDMA_Peripheral_Direction_MAX] =
{
#if defined(I2C1_BASE)
    {hwDMA_Channel_Index_1, hwDMA_Channel_Index_2},
#endif
#if defined(I2C2_BASE)
    {hwDMA_Channel_Index_4, hwDMA_Channel_Index_5},
#endif
};

DMA_TypeDef * DMA_Map_Soc_Base(hwDMA_Channel_Index index)
{
    switch(index)
    {
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
        case hwDMA_Channel_Index_1:
#endif
#if defined (DMA1_Channel2)
        case hwDMA_Channel_Index_2:
#endif
#if defined (DMA1_Channel3)
        case hwDMA_Channel_Index_3:
#endif
#if defined (DMA1_Channel4)
        case hwDMA_Channel_Index_4:
#endif
#if defined (DMA1_Channel5)
        case hwDMA_Channel_Index_5:
#endif
#if defined (DMA1_Channel6)
        case hwDMA_Channel_Index_6:
#endif
#if defined (DMA1_Channel7)
        case hwDMA_Channel_Index_7:
#endif
                return DMA1;
#endif
        default:
                break;
    }
    return NULL;
}

DMA_Channel_TypeDef * DMA_Map_Soc_Channel_Base(hwDMA_Channel_Index index)
{
    switch(index)
    {
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
        case hwDMA_Channel_Index_1: return DMA1_Channel1;
#endif
#if defined (DMA1_Channel2)
        case hwDMA_Channel_Index_2: return DMA1_Channel2;
#endif
#if defined (DMA1_Channel3)
        case hwDMA_Channel_Index_3: return DMA1_Channel3;
#endif
#if defined (DMA1_Channel4)
        case hwDMA_Channel_Index_4: return DMA1_Channel4;
#endif
#if defined (DMA1_Channel5)
        case hwDMA_Channel_Index_5: return DMA1_Channel5;
#endif
#if defined (DMA1_Channel6)
        case hwDMA_Channel_Index_6: return DMA1_Channel6;
#endif
#if defined (DMA1_Channel7)
        case hwDMA_Channel_Index_7: return DMA1_Channel7;
#endif
#endif
        default: break;
    }
    return NULL;
}

static void DMA_IRQ_Handler(hwDMA_Channel_Index index)
{
        if(index>=hwDMA_Channel_Index_MAX)
        {
                return;
        }

        HAL_DMA_IRQHandler(&g_dma[index]);
}

#if defined (STM32C011xx) || defined (STM32C031xx)
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
void DMA1_Channel1_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_1); }
#endif
#if defined (DMA1_Channel2) || defined (DMA1_Channel3)
void DMA1_Channel2_3_IRQHandler(void)
{
#if defined (DMA1_Channel2)
        DMA_IRQ_Handler(hwDMA_Channel_Index_2);
#endif
#if defined (DMA1_Channel3)
        DMA_IRQ_Handler(hwDMA_Channel_Index_3);
#endif
}
#endif
#endif
#elif defined (STM32C051xx) || defined (STM32C071xx)
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
void DMA1_Channel1_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_1); }
#endif
#if defined (DMA1_Channel2) || defined (DMA1_Channel3)
void DMA1_Channel2_3_IRQHandler(void)
{
#if defined (DMA1_Channel2)
        DMA_IRQ_Handler(hwDMA_Channel_Index_2);
#endif
#if defined (DMA1_Channel3)
        DMA_IRQ_Handler(hwDMA_Channel_Index_3);
#endif
}
#endif
#if defined (DMA1_Channel4) || defined (DMA1_Channel5)
void DMAMUX1_DMA1_CH4_5_IRQHandler(void)
{
#if defined (DMA1_Channel4)
        DMA_IRQ_Handler(hwDMA_Channel_Index_4);
#endif
#if defined (DMA1_Channel5)
        DMA_IRQ_Handler(hwDMA_Channel_Index_5);
#endif
}
#endif
#endif //DMA1_BASE
#elif defined (STM32C091xx) || defined (STM32C092xx)
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
void DMA1_Channel1_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_1); }
#endif
#if defined (DMA1_Channel2) || defined (DMA1_Channel3)
void DMA1_Channel2_3_IRQHandler(void)
{
#if defined (DMA1_Channel2)
        DMA_IRQ_Handler(hwDMA_Channel_Index_2);
#endif
#if defined (DMA1_Channel3)
        DMA_IRQ_Handler(hwDMA_Channel_Index_3);
#endif
}
#endif
#if defined (DMA1_Channel4) || defined (DMA1_Channel5)
void DMAMUX1_DMA1_CH4_5_6_7_IRQHandler(void)
{
#if defined (DMA1_Channel4)
        DMA_IRQ_Handler(hwDMA_Channel_Index_4);
#endif
#if defined (DMA1_Channel5)
        DMA_IRQ_Handler(hwDMA_Channel_Index_5);
#endif
#if defined (DMA1_Channel6)
        DMA_IRQ_Handler(hwDMA_Channel_Index_6);
#endif
#if defined (DMA1_Channel7)
        DMA_IRQ_Handler(hwDMA_Channel_Index_7);
#endif
}
#endif
#endif //DMA1_BASE
#else
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
void DMA1_Channel1_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_1); }
#endif
#if defined (DMA1_Channel2)
void DMA1_Channel2_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_2); }
#endif
#if defined (DMA1_Channel3)
void DMA1_Channel3_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_3); }
#endif
#if defined (DMA1_Channel4)
void DMA1_Channel4_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_4); }
#endif
#if defined (DMA1_Channel5)
void DMA1_Channel5_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_5); }
#endif
#if defined (DMA1_Channel6)
void DMA1_Channel6_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_6); }
#endif
#if defined (DMA1_Channel7)
void DMA1_Channel7_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_7); }
#endif
#endif //DMA1_BASE
#endif

void DMA_Clock_Enable()
{
#if defined (DMA1_BASE)
         __HAL_RCC_DMA1_CLK_ENABLE();
#endif //DMA1_BASE
}

